-- 添加专业
INSERT INTO  major_info(mID, mName) VALUES (17, '经济'), (21, '计算机'), (29, '哲学');
-- 添加老师信息
insert into teacher_info values ('101', 21, '赵老师', 1, '信息学院'), ('102', 29, '钱老师', 0, '文学院'), ('103', 29, '孙老师', 0, '文学院');
-- 添加学生信息
insert into student_info values ('1001', 17, '王伟', '男', '1999-9-9', '广东', '经济学院', 1);
insert into student_info values ('2001', 21, '王芳', '女', '2000-10-1', '北京', '信息学院', 1), ('2002', 21, '张伟', '男', '1996-5-1', '上海', '信息学院', 2), ('2003', 21, '李勇', '男', '1997-7-1', '天津', '信息学院', 2), ('3001', 29, '张静', '女', '1998-7-1', '重庆', '文学院', 2);
-- 添加课程信息
insert into course_info values ('201801', '经济学基础', 3, '1'), ('201802', '计算机导论', 4, '2');

insert into student_info values ('1001', 17, 'vancir', 'M', '1999-9-9', 'guangdong', 'economy', 1);